Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.InvalidLapSpliceInAreaReinforcement
The instance major/minor lap lengths must be smaller than 1/2 of the overall length from the type in major and minor directions, respectively. The default values set for this parameters did not respect this criteria so they were automatically reset to the type values.